foamfiles/counterFlowFlame2D/case_125/0/adapts/O2_adapted.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0]; // dimensionless

internalField   uniform 0.23; // 23 %

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    primary_air
    {
        type            fixedValue;
        value           uniform 0.23; // default 23% by vol
    }
    secondary_air_RHS
    {
        type            fixedValue;
        value           uniform 0.23; // default 23% by vol
    }
    secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 0.23; // default 23% by vol
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.23;
        value           uniform 0.23;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
