foamfiles/counterFlowFlame2D/case_125/0/adapts/T_adapted.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0]; // K

internalField   uniform 2000;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
    primary_air
    {
        type            fixedValue;
        value           uniform 293;
    }

   secondary_air_RHS 
    {
        type            fixedValue;
        value           uniform 293;
    }

    secondary_air_LHS 
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        type            inletOutlet; // differs from U check on it
        inletValue      uniform 293;
        value           uniform 293;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
